$(function () {
    var line = new Highcharts.chart({
        chart: {
            renderTo: 'budgetAndUsage',
            spacingBottom: 15,
            spacingTop: 10,
            spacingLeft: 10,
            spacingRight: 10,
        },
        title: {
            /* Solar Employment Growth by Sector */
            text: 'งบประมาณและผลรวมวงเงินเบิกจ่ายของกระทรวงมหาดไทยตั้งแต่ปี 2548-2562'
        },

        subtitle: {
            text: 'ที่มาของข้อมูล: dataservices.mof.go.th/Dataservices/GovernmentExpenditureEconomyMinistry'
        },

        yAxis: {
            title: {
                text: 'ล้านบาท'
            }
        },

        legend: {
            layout: 'vertical',
            align: 'right',
            verticalAlign: 'middle'
        },

        xAxis: {
            title: {
                text: 'ปี'
            }
        },

        plotOptions: {
            series: {
                label: {
                    connectorAllowed: 0
                },
                pointStart: 2005 + 543
            }
        },

        series: [{
                name: 'วงเงินเบิกจ่าย',
                data: [
                    127741.379, 143661.092, 161822.787, 190930.145, 177786.968,
                    174755.746, 213812.275, 250224.166, 266306.374, 280412.117,
                    316307.295, 319395.893, 313283.846, 350983.047, 249744.861
                ]
            },
            {
                name: 'งบประมาณ',
                data: [
                    139800.179, 160643.476, 179115.753, 190930.145, 207826.344,
                    187998.707, 239479.125, 285254.857, 308835.034, 333145.15,
                    340171.626, 341820.817, 335145.525, 386179.349, 371801.731
                ]

            }
        ],

        responsive: {
            rules: [{
                condition: {
                    maxWidth: 500
                },
                chartOptions: {
                    legend: {
                        layout: 'horizontal',
                        align: 'center',
                        verticalAlign: 'bottom'
                    }
                }
            }]
        }

    });
})

$(function () {
    var pie = new Highcharts.chart({
        chart: {
            styledMode: true,
            renderTo: 'pie',
            spacingBottom: 15,
            spacingTop: 10,
            spacingLeft: 10,
            spacingRight: 10,
            events: {
                redraw: function () {
                    setTimeout(function () {
                        label.fadeOut();
                    }, 1000);
                }
            }
        },

        title: {
            text: 'ส่วนแบ่งงบประมาณของแต่ละกรมในกระทรวงมหาดไทยปี 2559'
        },
        subtitle: {
            text: 'ที่มาของข้อมูล: govspending.data.go.th'
        },
        xAxis: {},

        series: [{
            name: 'งบประมาณ',
            type: 'pie',
            allowPointSelect: true,
            data: [{
                    "name": "กรมส่งเสริมการปกครองท้องถิ่น",
                    "y": 230646696100
                },
                {
                    "name": "กรมการปกครอง",
                    "y": 36679129100
                },
                {
                    "name": "กรมโยธาธิการและผังเมือง",
                    "y": 24911356600
                },
                {
                    "name": "กรุงเทพมหานคร",
                    "y": 16507110000
                },
                {
                    "name": "กรมป้องกันและบรรเทาสาธารณภัย",
                    "y": 5940205400
                },
                {
                    "name": "กรมที่ดิน",
                    "y": 5689034000
                },
                {
                    "name": "กรมการพัฒนาชุมชน",
                    "y": 5037318300
                },
                {
                    "name": "สนง.ปลัดกระทรวงมหาดไทย",
                    "y": 4970714100
                },
                {
                    "name": "เมืองพัทยา",
                    "y": 1592229500
                }
            ],
            showInLegend: true
        }],
    });
    $('#changeTo2559').click(function () {
        var data = [{
                "name": "กรมส่งเสริมการปกครองท้องถิ่น",
                "y": 230646696100
            },
            {
                "name": "กรมการปกครอง",
                "y": 36679129100
            },
            {
                "name": "กรมโยธาธิการและผังเมือง",
                "y": 24911356600
            },
            {
                "name": "กรุงเทพมหานคร",
                "y": 16507110000
            },
            {
                "name": "กรมป้องกันและบรรเทาสาธารณภัย",
                "y": 5940205400
            },
            {
                "name": "กรมที่ดิน",
                "y": 5689034000
            },
            {
                "name": "กรมการพัฒนาชุมชน",
                "y": 5037318300
            },
            {
                "name": "สนง.ปลัดกระทรวงมหาดไทย",
                "y": 4970714100
            },
            {
                "name": "เมืองพัทยา",
                "y": 1592229500
            }
        ];
        pie.series[0].setData(data)
        pie.setTitle({
            text: 'ส่วนแบ่งงบประมาณของแต่ละกรมในกระทรวงมหาดไทยปี 2559'
        })
    })
    $('#changeTo2560').click(function () {
        var data = [{
                "name": "กรมส่งเสริมการปกครองท้องถิ่น",
                "y": 225898850200
            },
            {
                "name": "กรมการปกครอง",
                "y": 38446186200
            },
            {
                "name": "กรมโยธาธิการและผังเมือง",
                "y": 25604004200
            },
            {
                "name": "กรุงเทพมหานคร",
                "y": 19974991800
            },
            {
                "name": "กรมการพัฒนาชุมชน",
                "y": 6292571500
            },
            {
                "name": "กรมที่ดิน",
                "y": 6137244800
            },
            {
                "name": "กรมป้องกันและบรรเทาสาธารณภัย",
                "y": 6039727700
            },
            {
                "name": "สำนักงานปลัดกระทรวงมหาดไทย",
                "y": 5060948600
            },
            {
                "name": "เมืองพัทยา",
                "y": 1691000000
            }
        ];
        pie.series[0].setData(data)
        pie.setTitle({
            text: 'ส่วนแบ่งงบประมาณของแต่ละกรมในกระทรวงมหาดไทยปี 2560'
        })
    })
    $('#changeTo2561').click(function () {
        var data = [{
                "agc": "กรมส่งเสริมการปกครองท้องถิ่น",
                "y": 241152826000
            },
            {
                "agc": "กรมการปกครอง",
                "y": 41691963000
            },
            {
                "agc": "กรมโยธาธิการและผังเมือง",
                "y": 26867162600
            },
            {
                "agc": "สำนักงานปลัดกระทรวงมหาดไทย",
                "y": 25134785000
            },
            {
                "agc": "กรุงเทพมหานคร",
                "y": 20895097100
            },
            {
                "agc": "กรมการพัฒนาชุมชน",
                "y": 16376334400
            },
            {
                "agc": "กรมที่ดิน",
                "y": 6403422900
            },
            {
                "agc": "กรมป้องกันและบรรเทาสาธารณภัย",
                "y": 5984321300
            },
            {
                "agc": "เมืองพัทยา",
                "y": 1753436600
            }
        ];
        pie.series[0].setData(data)
        pie.setTitle({
            text: 'ส่วนแบ่งงบประมาณของแต่ละกรมในกระทรวงมหาดไทยปี 2561'
        })
    })
    $('#changeTo2562').click(function () {
        var data = [{
                "agc": "กรมส่งเสริมการปกครองท้องถิ่น",
                "y": 254682429200
            },
            {
                "agc": "กรมการปกครอง",
                "y": 41621402300
            },
            {
                "agc": "กรมโยธาธิการและผังเมือง",
                "y": 26089394600
            },
            {
                "agc": "กรุงเทพมหานคร",
                "y": 21497494000
            },
            {
                "agc": "กรมป้องกันและบรรเทาสาธารณภัย",
                "y": 7390106400
            },
            {
                "agc": "กรมการพัฒนาชุมชน",
                "y": 6932677000
            },
            {
                "agc": "กรมที่ดิน",
                "y": 6035559800
            },
            {
                "agc": "สำนักงานปลัดกระทรวงมหาดไทย",
                "y": 5610248500
            },
            {
                "agc": "เมืองพัทยา",
                "y": 1725817400
            }
        ];
        pie.series[0].setData(data)
        pie.setTitle({
            text: 'ส่วนแบ่งงบประมาณของแต่ละกรมในกระทรวงมหาดไทยปี 2562'
        })
    })
})

$(function () {
    var bar = new Highcharts.chart({
        chart: {
            type: 'column',
            renderTo: 'bar',
            spacingBottom: 15,
            spacingTop: 10,
            spacingLeft: 10,
            spacingRight: 10,
        },
        title: {
            text: 'งบประมาณของแต่ละกรมในกระทรวงมหาดไทยปี 2559-2562'
        },
        subtitle: {
            text: 'ที่มาของข้อมูล: dataservices.mof.go.th/Dataservices/GovernmentExpenditureEconomyMinistry'
        },
        xAxis: {
            categories: [
                '2559',
                '2560',
                '2561',
                '2562',
            ],
            crosshair: true
        },
        yAxis: {
            min: 0,
            title: {
                text: 'ล้านบาท'
            }
        },
        tooltip: {
            headerFormat: '<span style="font-size:10px">{point.key}</span><table>',
            pointFormat: '<tr><td style="color:{series.color};padding:0">{series.name}: </td>' +
                '<td style="padding:0"><b>{point.y:.1f} ล้านบาท</b></td></tr>',
            footerFormat: '</table>',
            shared: true,
            useHTML: true
        },
        plotOptions: {
            column: {
                pointPadding: 0.2,
                borderWidth: 0
            }
        },
        series: [{
            name: 'กรมส่งเสริมการปกครองท้องถิ่น',
            data: [230646696100.0 / 1000000, 225898850200.0 / 1000000, 241152826000.0 / 1000000, 254682429200.0 / 1000000]

        }, {
            name: 'กรมการปกครอง',
            data: [36679129100.0 / 1000000, 38446186200.0 / 1000000, 41691963000.0 / 1000000, 41621402300.0 / 1000000]

        }, {
            name: 'กรุงเทพมหานคร',
            data: [16507110000.0 / 1000000, 19974991800.0 / 1000000, 20895097100.0 / 1000000, 21497494000.0 / 1000000]

        }, {
            name: 'กรมที่ดิน',
            data: [5689034000.0 / 1000000, 6137244800.0 / 1000000, 6403422900.0 / 1000000, 6035559800.0 / 1000000]

        }, {
            name: 'กรมการพัฒนาชุมชน',
            data: [5037318300 / 1000000, 6292571500 / 1000000, 16376334400 / 1000000, 6932677000 / 1000000]

        }, {
            name: 'กรมป้องกันและบรรเทาสาธารณภัย',
            data: [5940205400 / 1000000, 6039727700 / 1000000, 5984321300 / 1000000, 7390106400 / 1000000]

        }, {
            name: 'เมืองพัทยา',
            data: [1592229500 / 1000000, 1691000000 / 1000000, 1753436600 / 1000000, 1725817400 / 1000000]

        }, {
            name: 'กรมโยธาธิการและผังเมือง',
            data: [24911356600 / 1000000, 25604004200 / 1000000, 26867162600 / 1000000, 26089394600 / 1000000]

        }, {
            name: 'สำนักงานปลัดกระทรวงมหาดไทย',
            data: [4970714100 / 1000000, 5060948600 / 1000000, 25134785000 / 1000000, 5610248500 / 1000000]

        }]
    });
})